---
kind: property
id: P:Autodesk.Revit.UI.UIControlledApplication.IsViewerModeActive
source: html/e5cd8514-02d6-efe1-2172-13b2358bf7fd.htm
---
# Autodesk.Revit.UI.UIControlledApplication.IsViewerModeActive Property

Determines if Revit session is in Viewer mode.

## Syntax (C#)
```csharp
public bool IsViewerModeActive { get; }
```